#!/usr/bin/bash

# 2. Да се напише SHELL скрипта која како аргумент добива листа од имиња на датотеки. SHELL скриптата
# треба да ја повика повика PERL Скриптата од првата задача онолку пати колку што има датотеки од
# командна линија. При секој повик, на PERL Скриптата (како аргументи) ја испраќа содржината на
# соодветната датотека. Резултатот од повикот го запишува во истата датотека само во продолжение
# (append).

brojarg=$#
count=0

while [ $count -lt $brojarg ] 
do 
    rez=$(cat $1)
    rez2=$(./zad1.pl $rez)
    echo "$rez2">>$1
    shift 1
    count=$(($count + 1))
done
