#!/usr/bin/bash

# 2. Да се напише SHELL скрипта која како аргумент од командна линија добива име на датотека. 
# Скриптата треба да ја трансформира датотеката така што ќе ги замени цртичките, запирките и 
# извичниците со точка. Потоа, SHELL скриптата треба да ја повика PERL скриптата од задача 1, 
# со претходно трансформираната датотека и на екран да ја прикаже содржината на 
# резултантната датотека (од повикот на PERL скриптата). 

if [ $# -lt 1 ] 
then
    echo "Nema dovolno arguenti"
    exit
fi

rez=$(sed -e 's/\-/./g' -e 's/,/./g' -e 's/!/./g' $1)
$(./zad1.pl $1)
cat "${$1}_fix"